Repository: knetsooj/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/development.po
Languages: nl

source: Developing with DSMR-reader
nl: Ontwikkelen met DSMR-reader

source: Contents
nl: Inhoudsopgave

source: In this document there are many references to::
nl: In dit document zijn er vele referenties naar::

source: You will only have to execute it once per terminal session, to make sure you are working in the designated virtual env for DSMR-reader.
nl: Je hoeft dit slechts eenmaal per terminal sessie uit te voeren, om er zeker van te zijn dat je in de betreffende virtual env werkt voor DSMR-reader.

source: Setting up a development environment in Ubuntu 18.04
nl: Ontwikkelomgeving inrichten voor Ubuntu 18.04

source: System packages::
nl: Systeempackages::

source: Clone DSMR-reader repository from Github::
nl: Kloon DSMR-reader repository van Github::

source: Create virtualenv and install all packages::
nl: Maak virtualenv aan en installeer alle packages::

source: Copy development config::
nl: Kopieer de ontwikkel config::

source: Try a check, output should be something like ``System check identified no issues (0 silenced).``::
nl: Probeer het volgende, de output moet iets zijn in de trend van ``System check identified no issues (0 silenced).``::

source: Run quick tests (with in-memory database)::
nl: Draai de snelle tests (via in-memory database)::

source: Set up PostgreSQL test database::
nl: Stel PostgreSQL testdatabase in::

source: Set up MySQL (or MariaDB) test database::
nl: Stel MySQL (of MariaDB) testdatabase in::

source: Now check whether tests run well with all three database backends (this may take a while)::
nl: Controleer nu of de tests goed draaien met alle drie de database-backends (dit kan even duren)::

source: Initial data to develop with
nl: Initiele gegevens om mee te ontwikkelen

source: To be honest, the best initial/fixture data is simply a backup of your own system in production.
nl: De beste gegevens om mee te ontwikkelen zijn eerlijk gezegd simpelweg gegevens uit je eigen productieomgeving.

source: Just import it as you should on your RaspberryPi. Copy a database backup to ``/var/lib/postgresql/`` on your PC and import it::
nl: Importeer deze zoals je dat ook zou doen op je RaspberryPi. Kopieer een database-backup naar ``/var/lib/postgresql`` op je PC en importeer deze met::

source: Please note that you should not run any (backend) processes in your DSMR-reader development environment, until you've unlinked all external services.
nl: N.B.: Voorkom dat je (achtergrond)processen draait in je lokale DSMR-reader ontwikkelomgeving, totdat je alle externe diensten hebt ontkoppeld.

source: After importing the backup of your production system, simply run::
nl: Voer simpelweg het volgende uit, na het importeren van een backup uit je eigen productieomgeving::

source: This will remove all API keys and other links to externals systems, as well as reset the admin user credentials to ``admin / admin`` (user / password).
nl: Dit verwijdert alle API-keys en andere koppelingen naar externe systemen. Tevens wordt de admin-gebruiker gereset naar ``admin / admin`` (gebruiker / wachtwoord).

source: Fake datalogger
nl: Nep datalogger

source: There is a builtin command that can somewhat fake a datalogger::
nl: Er is een ingebouwd command voor een soort van datalogger die nepdata genereert::

source: It will generate random data every second in a certain pattern and should be fine for basic testing.
nl: Deze genereert elke seconde willekeurige gegevens in een bepaald patroon en is vaak meer dan afdoende voor simpele testdoeleinden.

source: Please note that it only inserts unprocessed readings, so you'll still have to run the ``./manage.py dsmr_backend --run-once`` command to have the readings processed.
nl: N.B.: Hiermee worden alleen onverwerkte metingen aangemaakt. Je zult ze nog steeds moeten verwerken door ``./manage.py dsmr_backend --run-once`` uit te voeren.

source: Running DSMR-reader locally
nl: DSMR-reader lokaal draaien

source: You can run the Django development server with::
nl: Je kunt de Django-ontwikkelserver draaien met::

source: The application will be accessible on: ``http://localhost:8000/``. Any code changes you make will let the application reload automatically.
nl: De applicatie is nu bereikbaar op: ``http://localhost:8000/``. Elke codewijziging die je doet, wordt automatisch doorgevoerd en herlaadt de applicatie.

source: Tests and coverage
nl: Tests en dekking

source: DSMR-reader's test coverage should remain as high as possible. Running tests will also analyze the test coverage in detail.
nl: DSMR-reader's test dekking zou zo hoog mogelijk moeten blijven. Het draaien van tests zorgt er ook voor dat de test dekking in detail geanalyseerd wordt.

source: The easiest way to run tests is to use the in-memory tests::
nl: De makkelijkste manier om tests te draaien is via de in-memory tests::

source: To test a single app within DSMR-reader, just append it::
nl: Om een enkele app binnen DSMR-reader te testen, geef je deze simpelweg als extra argument op::

source: To test all database backends, run::
nl: Om alle database-backends te testen voer je het volgende uit::

source: The test coverage should be visible in the terminal after running tests. There are detailed HTML pages available as well, after each test run, in ``coverage_report/html/index.html``. Just open it with your browser to view the test coverage of each file and line.
nl: De test dekking zou na het draaien van tests zichtbaar moeten zijn in de terminal. Er zijn tevens gedetaileerde HTML-pagina's beschikbaar in ``coverage_report/html/index.html``, na het draaien van tests. Je kunt deze openen met je browser om de test dekking in detail te zien per bestand en per regel code.

source: A side effect of running tests is that it may also regenerate .PO files from the ``docs/`` folder. If you did not make any changes there, your should just ignore those changed files and revert them.
nl: Een mogelijk bijeffect van het draaien van tests is dat hiermee ook .PO-bestanden in de ``docs/`` map bijgewerkt worden. Als je daar geen wijzigingen in hebt gedaan, kun je die door de tests gewijzigde bestanden negeren.

source: Translations
nl: Vertalingen

source: You can find the translations (.PO files) for the main application in ``dsmrreader/locales/``. To regenerate them, just execute the ``./tools/quick-test.sh`` script, as one of the tests checks translations.
nl: Je kunt de vertalingen (.PO-bestanden) voor de hoofdapplicatie vinden in ``dsmrreader/locales/``. Om ze te hergenereren voer het ``./tools/quick-test.sh`` script uit, zodat een van de tests de vertalingen opnieuw checkt.

source: Editing documentation
nl: Documentatie bijwerken

source: The documentation is part of the repository and can be generated (automatically) with Sphinx::
nl: De documentatie is onderdeel van de repository en kan (automatisch) gegenereerd worden via Sphinx::

source: You can now view the documentation in your browser by accessing: ``http://127.0.0.1:10000``. Any changes you make will be reflected instantly in the browser, as Sphinx continuously checks for changed files.
nl: Je kunt nu de documentatie bekijken in je browser op de volgende link: ``http://127.0.0.1:10000``. Wijzigingen die je doorvoert worden direct automatisch bijgewerkt en getoond in je browser, waar Sphinx voor zorgt.

source: Translating documentation
nl: Documentatie vertalen

source: Translations are done using gettext and .PO files. Regenerate the .PO files with::
nl: Vertalingen verlopen via .PO-bestanden met gettext. Hergenereer de .PO-bestanden met::

source: The .PO files in ``docs/locale`` should be regenerated now. You can use ``poedit`` to view and translate the files.
nl: De .PO-bestanden in ``docs/locale`` zouden nu opnieuw gegenereerd moeten worden. Je kunt het programma ``poedit`` gebruiken om de bestanden te bekijken en te vertalen.

source: After editing the .PO files, you can check the result by building the Dutch translations locally::
nl: Nadat je de .PO-bestanden hebt bijgewerkt, kun je de resultaten bekijken door de Nederlandse variant van de documentatie lokaal te genereren::

source: Now view the generated HTML in your browser by opening: ``docs/_build/html/index.html``
nl: Bekijk nu de gegenereerde HTML in je browser door het volgende bestand te openen: ``docs/_build/html/index.html``

source: Please make sure to always point any pull requests to the ``development`` branch of DSMR-reader, as the ``master`` branch will only be affected by release merges.
nl: Zorg ervoor dat je pull requests altijd laat wijzen naar de ``development`` branch van DSMR-reader, gezien ``master`` alleen gebruikt wordt voor release-merges.
