Repository: knetsooj/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/troubleshooting.po
Languages: nl

source: Troubleshooting
nl: Hulp bij problemen

source: Contents
nl: Inhoudsopgave

source: If anything happens to fail or malfunction, please follow the steps below first to provide some background information when reporting an issue.
nl: Wanneer er iets lijkt mis te gaan, volg de onderstaande stappen eerst, voordat je een issue aanmaakt. Hiermee kun je wat meer achtergrondinformatie aanleveren.

source: DSMR-reader technically consists of these processes (some may or may not be used by you) and they are watched by Supervisor:
nl: DSMR-reader bestaat technisch uit deze processen (sommigen zullen wel of niet in je eigen situatie gebruikt worden) en ze worden beheerd door Supervisor:

source: Export or MQTT
nl: Export of MQTT

source: You can view the status of all processes by running::
nl: Je kunt de status van alle processen bekijken door het volgende uit te voeren::

source: Any processes listed, should have the status ``RUNNING``. Stale or crashed processes can be restarted with::
nl: Elk proces dat getoond wordt zou de status ``RUNNING`` moeten hebben. Hangende of gecrashde processen kunnen herstart worden met::

source: Or to restart them all simultaneously::
nl: Of herstart ze allemaal tegelijkertijd::

source: If this does not resolve your issue, check the logfiles for more information:
nl: Wanneer dit niet je probleem oplost, bekijk de logbestanden voor meer informatie:

source: ``/var/log/supervisor/dsmr_export.log`` or ``/var/log/supervisor/dsmr_mqtt.log``
nl: ``/var/log/supervisor/dsmr_export.log`` of ``/var/log/supervisor/dsmr_mqtt.log``

source: If the processes do run, but you cannot find an error, (e.g.: things seem to hang or tend to be slow), there might be another issue at hand.
nl: Wanneer de processen lijken te draaien, maar je kunt geen fout vinden (bijvoorbeeld als telegrammen hangen of de verwerking traag lijkt), dan is er waarschijnlijk iets anders aan de hand.

source: DSMR-reader has DEBUG-logging, which makes the system log very verbose about what it's trying to do. This applies **specifically** to the ``dsmr_backend`` and ``dsmr_export`` (MQTT) processes.
nl: DSMR-reader heeft DEBUG_logging, waarmee het systeem heel letterlijk logt wat het aan het doen is. Dit geldt **specifiek** voor de ``dsmr_backend`` en ``dsmr_export`` (MQTT) processen.

source: The DEBUG-logging is disabled by default, to reduce writes on the filesystem. You can enable the logging by following these steps:
nl: De DEBUG-logging is standaard uitgeschakeld, om het aantal schrijfacties op het bestandssysteem te beperken. Je kunt het inschakelen door deze stappen te volgen:

source: Make sure you are ``dsmr`` user by executing ``sudo su - dsmr``.
nl: Zorg ervoor dat je ``dsmr`` gebruiker bent door ``sudo su - dsmr`` uit te voeren.

source: Open the ``dsmrreader/settings.py`` file and look for the code below::
nl: Open ``dsmrreader/settings.py`` en zoek de onderstaande code::

source: Now remove the ``#`` from this line::
nl: Verwijder nu de ``#`` uit de regel::

source: It should now be::
nl: Het zou nu dit moeten zijn::

source: After editing the file, all processes need to be restarted. To do this, you can either execute::
nl: Na het bewerken van het bestand zul je alle processen moeten herstarten. Om dit te doen, voer het volgende uit::

source: Or go back to the **sudo user** and execute::
nl: Of ga terug naar de **sudo gebruiker** en voer dit uit::

source: All done!
nl: Klaar!

source: Appplication / Django
nl: Appplicatie / Django

source: The application has its own logfiles as well. You can find them in the ``logs`` directory inside the project folder.
nl: De applicatie heeft ook eigen logfiles. Je kunt deze vinden in de ``logs`` directory binnen de projectmap.

source: The logfiles are by default located in:
nl: De logbestanden staan standaard in:

source: Lists any internal errors regarding the Django framework it's using
nl: Bevat interne foutmeldingen over het gebruikte Django framework

source: Contains application logging, if enabled
nl: Bevat applicatie-logging, wanneer ingeschakeld

source: Please note that any errors in there are most likely regarding rejected telegrams and are unlikely causing your issue::
nl: N.B.: Waarschijnlijk staan er in de meeste gevallen fouten in die verder niets te maken hebben met jouw probleem, maar met afgewezen telegrammen::

source: Are you unable to resolve your problem or do you need any help? :doc:`More information can be found here<contributing>`.
nl: Kom je er toch niet uit of heb je hulp nodig? :doc:`Meer informatie kun je hier vinden<contributing>`.
